Repository: 84000/data-translation-memory
Catalog: toh349-v4.tmx
Source language: bo
Languages: en

source: །ཤེས་རབ་ལྡན་མི་མང་པོ་དང་། །འཇིག་རྟེན་དག་ཀྱང་བརླག་པར་འགྱུར།
en: There will not be many wise people left And worldly ones will also be destroyed. “

source: །ཇི་ལྟ་ཇི་ལྟར་མཐོང་གྱུར་པའི། །ས་ཡི་མཚན་མ་དུ་མ་ཡིས། །ངེས་པར་ཡུན་ནི་མི་རིང་བར། །རྒྱལ་པོ་སེང་གེ་མེད་པར་འགྱུར།
en: ‘Through many omens of the earth, Which can be clearly seen, It is certain that it won’t be long Before the lion king is no more.

source: །དྲི་མེད་མི་ཡི་ཉི་མ་འདི།
en: “ ‘This stainless sun of humanity,

source: །ཤིན་ཏུ་རྙེད་དཀའ་དེ་ནུབ་འགྱུར།
en: So difficult to find, is about to set.

source: །ཡུན་མི་རིང་བར་འཇིག་རྟེན་འདིར། །མི་སྣང་བ་ནི་འབྱུང་བར་འགྱུར།
en: Before long, it will no longer Shine forth in this world.

source: །སེམས་ཅན་ཀུན་ལ་ཕན་པ་ཡི། །རྒྱལ་པོ་ཆེན་པོ་འདི་མེད་དེ།
en: “ ‘In the absence of this great king Who benefits all sentient beings,

source: །ཕྱི་ནས་འཇིག་རྟེན་མི་སྣང་ན།
en: When his light no longer illumines the world,

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཇི་ལྟ་ཇི་ལྟར་རྨོངས་པར་བྱས་པ་དེ་ལྟར་མྱ་ངན་ཆུང་བར་གྱུར་ནས་སོག་ལེས་བཏབ་པར་གྱུར་ཏོ།
en: “After this speech, the two carpenters whom Śakra, lord of the gods, had enchanted recovered enough from their grief to reapply the saw to the bodhisattva’s body.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་ཤིང་མཁན་དེ་གཉིས་ལ་བཞིན་བཟངས་དགེ་ཁྱེད་ཅག་གཉིས་ཀྱིས་སོག་ལེ་མྱུར་དུ་དྲོངས་ལ་ངའི་ལུས་ཀྱི་ཕྱེད་རོ་སྨད་ཆོད་ཅིག །བྲམ་ཟེ་འདི་ཤི་བར་གྱུར་ན་ངའི་ངལ་བ་འབྲས་བུ་མེད་པར་མི་འགྱུར་གྲང་།
en: The bodhisattva encouraged them. ‘Well done, good people! Cut off the lower half of my body more quickly! Won’t my travail be fruitless if the brahmin dies?’

source: དེ་ནས་ཤིང་མཁན་དེ་གཉིས་བརྒྱ་བྱིན་གྱི་མཐུས་ཀུན་དུ་རྨོངས་པས་ཉམ་ཐག་པའི་ང་རོས་ཆོ་ངེས་འདེབས་ཤིང་སྐྱེ་བོའི་ཚོགས་ཆེན་པོས་བཀག་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རང་གི་ལུས་ལ་སོག་ལེས་འདྲ་བར་བརྩམས་སོ།
en: “There was a great crowd of people wailing, mourning, and attempting to stop the two carpenters from following the bodhisattva’s instructions and cutting his body, but Śakra had stupefied them.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཡིད་ལ་སྨོན་ཅིང་དགའ་བའི་ཡིད་ཀྱིས་སློང་བའི་ཡིད་ལ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱའོ་ཞེས་བསམས་ནས་ཅང་མི་སྨྲ་བར་གནས་སོ།
en: The bodhisattva kept silent, aspiring for awakening and joyously intending to fulfill the gift seeker’s wishes.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་ལྟེ་བར་སོག་ལེས་བཅད་པ་ལས་ཁྲག་གི་ཚོགས་ཆེན་པོ་འབབ་པར་གྱུར་ཏོ།
en: After a while, a great deal of blood gushed from the bodhisattva’s middle where the saw was cutting.

source: །དེ་ནས་བློན་པོ་བློ་གྲོས་ཆེན་པོ་འདི་ལྟར་སོག་ལེས་བཅད་པ་ཚོར་བ་དྲག་པོས་ཉེན་པའི་ཁྲག་འབབ་པ་མཐོང་བ་དང་། ལྷ་བཀྲོངས་པ་ནི་སྡུག་བསྔལ་ལོ་ཞེས་བསམས་ནས་རེ་ཐག་ཆད་པར་གྱུར་ཏེ།
en: Seeing this, the great minister Mahāmati became despondent and fell unconscious, thinking, ‘It is too painful to see the lord killed.’

source: འཕྲལ་དུ་བརྒྱལ་ནས་སའི་སྟེང་དུ་འགྱེལ་བར་གྱུར་ཏོ། །ནམ་མཁའི་དཀྱིལ་ན་གནས་པའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་ཚོགས་རྣམས་ཀྱང་མྱ་ངན་དྲག་པོས་གདུངས་ཏེ་ངུ་བར་བརྩམས་ཏེ། དེ་རྣམས་ཀྱིས་ངུ་བའི་མཆི་མ་བླགས་སོ།
en: “Wracked by intense grief, masses of sky-dwelling gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas started to cry.

source: །དེ་ནས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོས་འདི་ཅི་ཞིག་ཡིན་སྙམ་ནས་སྟེང་དུ་བལྟ་བར་བརྩམས་པ་དང་། ཇི་ཙམ་ན་ལྷ་བརྒྱ་སྟོང་དུ་མ་རྣམས་ངུ་བར་མཐོང་ངོ་།
en: As their tears flowed, the crowds of people below wondered what was happening and looked up at the sky. There they saw hundreds of thousands of weeping gods, which made them fall further into grief.

source: །དེ་ནས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་ཤས་ཆེར་མྱ་ངན་དྲག་པོས་གདུངས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་གནས་སྐབས་འདི་ལྟ་བུར་ཤིན་ཏུ་སྡུག་བསྔལ་བར་མཐོང་ནས།
en: They saw the bodhisattva in great pain and, becoming utterly confused, they thought,

source: ཀྱི་ཧུད་ལྷ་བཀྲོངས་པ་ནི་སྡུག་བསྔལ་ལོ་ཞེས་བསམས་ནས་ཀུན་དུ་རྨོངས་པར་གྱུར་ཏོ། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དེ་སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མ་འདི་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་མྱ་ངན་གྱིས་གདུངས་པས་ཤིན་ཏུ་སྙིང་རྗེ་ཞིང་ཞུམ་པ་མཐོང་བ་དང་མྱུར་བར་སྙིང་རྗེའི་ཡིད་ཀྱིས་བསམས་པ་བདག་ཉིད་ཆེ་བ།
en: ‘Alas! It is so very painful to see the lord killed!’ “A few moments later, Śakra, lord of the gods, gazed with intense compassion and concern upon the hundreds of thousands of beings who were stricken by the bodhisattva’s tragedy. Then compassionate thoughts suddenly arose in him.

source: སེམས་ཅན་ཐམས་ཅད་ལ་མཉེས་གཤིན་པ། སྙིང་རྗེ་ཅན་ཐམས་ཅད་སྟེར་བ་འདིའི་ལུས་ལ་འདི་ལྟར་ཚོར་བ་དྲག་པོའི་ལས་ཀུན་དུ་སྦྱོར་བ་ནི་བཟང་པོ་མ་ཡིན་ནོ།
en: ‘It is not right to cause intense pain to this great being who is so kind and affectionate toward all sentient beings and who gives away everything out of compassion.

source: །གཞན་དུ་ན་ད་ནི་ཇི་ལྟར་སྲོག་མི་འཇིག་པར་གྱུར་པ་དེ་ལྟར་བྱའོ།
en: I will do the opposite. I will make him immortal.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཤིང་མཁན་དེ་གཉིས་ཀྱིས་སོག་ལེས་དྲུད་ཅིང་སོག་ལེ་རྣོན་པོས་ལུས་བཅད་པའི་ཚོར་བ་དྲག་པོས་གདུངས་པ་དང་། བརྟན་པའི་སྟོབས་དང་ལྡན་པས་སློང་བ་ལ་བྱམས་པའི་སེམས་སྐྱེས་ནས་བསམས་པ།
en: “As the two carpenters cut his body with the sharp saw, the bodhisattva suffered intense pain. But he had the power to keep his mind stable and generate a loving attitude toward the gift seeker.

source: ངས་འཁོར་བའི་སྐྱོན་གྱི་རང་བཞིན་ཤེས་ནས་བརྩོན་འགྲུས་སྲ་ཞིང་བརྟན་པ་དང་ལྡན་པས་ལུས་ཕྱོགས་གཅིག་བཅད་པ་འདི་ལས་འདི་ལྟ་བུའི་སྡུག་བསྔལ་སྐྱེ་ན། སེམས་ཅན་སྔ་མ་རྣམས་ཕལ་ཆེར་དམྱལ་བར་སྐྱེས་ནས་ཤིན་ཏུ་སྡུག་བསྔལ་བའི་ཚོར་བ་རྣམས་ཀྱིས་གདུངས་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས། དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ལ་རྗེས་སུ་འགྲོ་བ་བྱམས་པའི་སེམས་རྣམ་པར་བཞག་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་འདི་ལྟ་བུའི་སྡུག་བསྔལ་ལས་ཐར་བར་བྱའོ་ཞེས་སེང་གེའི་སྒྲ་བསྒྲགས་ཏེ།
en: ‘If I have understood the nature of saṃsāra’s faults and thereby gained firm and lasting perseverance but am nonetheless suffering this much pain as my body is cut in half, what can be said of the excruciating painful sensations suffered by the majority of sentient beings when they previously took rebirth in hell!’ Thinking thus, the bodhisattva established a loving mind that encompassed all sentient beings, and with a lion’s roar, he declared, ‘By attaining unsurpassed and perfect awakening, I must free sentient beings from such suffering!’

source: སྡུག་བསྔལ་དྲག་པོས་གདུངས་པའི་རང་གི་སེམས་སྤྲོ་བར་བྱ་བའི་ཕྱིར་སྨྲས་པ།
en: “In order to uplift his own mind that was wracked by such intense pain, the bodhisattva also said the following:

source: འཇིག་རྟེན་སྡུག་བསྔལ་ལྟོས་ལ་ཡིད་ཁྱོད་སྐྱོན་སྤངས་ཏེ།
en: “ ‘Look at the world’s suffering, mind, and abandon your faults!

source: །ཤིན་ཏུ་བརྟན་པ་རྒྱ་ཆེ་བསྐྱེད་པ་ཉིད་དུ་གྱིས།
en: Be very steady and develop vastness in scope.

source: །འགྲོ་བ་སྐྱེ་རྒ་ན་འཆི་སྡུག་བསྔལ་གྱིས་གདུངས་པའི། །འདི་ནི་སྐྱབས་གྱུར་ཡིད་ཀྱིས་བཟོད་ཉིད་བརྟན་པར་གྱིས།
en: Be mentally stable in patient endurance so as to protect These beings tormented by the pain of birth, aging, sickness, and death.’

source: །གཞན་ཡང་ཀྱེ་སེམས་ཅན།
en: And again he said: “ ‘Alas, these poor sentient beings!

source: གང་ཕྱིར་འགྲོ་ཀུན་འཁོར་བ་ཡི།
en: Because you are the cause for all beings

source: །རྒྱ་མཚོ་ལས་རྒལ་རྒྱུ་ཡིན་གྱིས།
en: To cross over the ocean of saṃsāra,

source: །དེ་བས་ཁྱོད་ནི་གནོད་པ་རྣམས།
en: It would be unreasonable for you

source: །མི་བཟོད་པ་ནི་རིགས་མ་ཡིན།
en: To not patiently endure such harms.’

source: །དེ་ལྟར་རང་གི་སེམས་ཡང་དག་པར་བཞག་ནས་སེམས་ཅན་ཐམས་ཅད་རྗེས་སུ་འགྲོ་བའི་སྙིང་རྗེ་ཉེ་བར་བཞག་སྟེ་བསམས་པ།
en: “These were the ways the bodhisattva truly settled his mind and established a compassionate attitude toward all sentient beings.

source: ཀྱེ་མའོ་འཁོར་བ་ན་གནས་པའི་སེམས་ཅན་གྱི་སྡུག་བསྔལ་ནི་ཀྱེ་མ་མི་བཟད་པ་ཡིན་ལ།
en: He thought to himself, ‘Alas! The suffering of beings who are stuck in saṃsāra is unbearable.

source: འཁོར་བའི་སེམས་ཅན་དེ་རྣམས་ཀྱི་དོན་དུ་འཁོར་བའི་སྡུག་བསྔལ་ཐམས་ཅད་མནགས་པར་སྤྲོ་བར་བྱས་ཀྱིས་སེམས་ཅན་འགའ་ཡང་སྡུག་བསྔལ་བའི་སྐལ་བ་ཅན་དུ་མ་གྱུར་ཅིག །དགེ་སློང་དག་སེམས་བསྐྱེད་མ་ཐག་བྱང་ཆུབ་སེམས་དཔའི་ལུས་བཅད་པའི་ཚོར་བ་འཕྲལ་དུ་རྒྱུན་ཆད་པར་གྱུར་ཏོ།
en: For the sake of these beings in saṃsāra, by rejoicing in patiently enduring all saṃsāra’s suffering, may no sentient being have the misfortune of suffering!’ “Monks, the very instant the bodhisattva generated this mind of awakening, the pain produced by his body being sawed abruptly ceased.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་བསམས་པ། ཅིའི་ཕྱིར་ངའི་ལུས་བཅད་པའི་ཚོར་བ་འགགས་པར་གྱུར།
en: The bodhisattva wondered, ‘Why did the pain of my body being sawed in two cease?

source: སོག་ལེ་འགའ་ཞིག་གིས་བཏོན་པར་མ་གྱུར་གྲང་སྙམ་ནས་སོག་ལེ་དེ་ལ་བལྟས་སོ།
en: Did they stop sawing?’ He checked, but he could still see the saw.

source: །བལྟས་ནས་ཀྱང་མཆོག་ཏུ་ཡིད་མི་བདེ་བར་གྱུར་ནས་འདར་བར་གྱུར་ཏོ།
en: Having seen it, he felt extremely distressed and started to shake.

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དེའི་བསམ་པ་ཤེས་ནས་སྨྲས་པ།
en: “Reading the king’s mind, Śakra, lord of the gods, said:

source: ཉམ་ཆུང་ནད་པ་ཇི་བཞིན་དུ། །རྒྱལ་པོ་ཅི་ཕྱིར་འདར་བར་བྱེད།
en: “ ‘King, why do you shake so, Like a feeble, sickly person?

source: །བདག་གི་ལུས་ཕྱེད་བཅད་ན་ཡང་།
en: Look at how my body is cut in half,

source: །སེམས་ནི་མི་འདར་བ་ལ་ལ་ལྟོས།
en: Yet my mind is not shaken.

source: །ཁྱོད་ནི་ཐམས་ཅད་སྟེར་བ་ཞེས། །ས་སྟེང་ཀུན་དུ་གྲགས་པ་ལ།
en: “ ‘You are renowned all over the earth For saying that you give everything away.

source: །འགྱོད་པར་བྱེད་པ་མི་རིགས་ཏེ།
en: So it doesn’t make sense to feel regret,

source: །ཁྱོད་ཚིག་བརྫུན་དུ་མ་གྱུར་ཏམ།
en: Or else your words would be lies.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། བྲམ་ཟེ་དོན་དེའི་ཕྱིར་ལུས་འདར་བ་མ་ཡིན་ལ།
en: “ ‘Brahmin,’ responded the bodhisattva, ‘this is not why my body shakes.

source: འགྱོད་པར་གྱུར་པ་འགའ་ཡང་ཡོད་པ་མ་ཡིན་ནོ།
en: I have no regrets whatsoever.

source: །འོན་ཀྱང་སོག་ལེ་འདིས་ངའི་ལུས་ཀྱི་ཕྱེད་སྨད་ཚབས་ཆེར་ཞུགས་ཀྱང་མ་ཆོད་པ་དང་། དེ་ལ་ང་འདི་སྙམ་དུ་སེམས་ཏེ།
en: I am shaking at this thought: “The saw has penetrated deep into my body, but so far my lower body has not been severed.

source: ངའི་སྦྱིན་པ་མ་རྫོགས་པར་མི་འགྱུར་གྲང་།
en: What if I am unable to make this gift?

source: ང་ལ་སློང་བའི་ཡིད་ལ་རེ་བ་ཡང་ཡོངས་སུ་རྫོགས་པར་མི་འགྱུར་གྲང་ཞེས་དོན་དེ་རྗེས་སུ་སེམས་ཤིང་ལུས་འདར་ཏེ་སོག་ལེས་དྲག་ཏུ་གཅོད་པར་མི་འདོད་པ་མ་ཡིན་ནོ། །དེ་ལ་དེ་སྐད་ཅེས་སྨྲས་པ་དང་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་མཆོག་ཏུ་ངོ་མཚར་སྐྱེས་ནས་ཅང་མི་སྨྲ་བར་གནས་སོ།
en: What if I am not able to fulfill the gift seeker’s wish?” I would be happy if they were to saw my body with more force.’ Hearing this, Śakra, lord of the gods, was completely in awe of the bodhisattva and fell silent.

source: །བར་སྐབས་དེར་མི་དེ་གཉིས་བརྒྱ་བྱིན་གྱིས་ཀུན་དུ་རྨོངས་པར་བྱས་པས་དེ་གཉིས་ཀྱིས་སོག་ལེ་རྣོན་པོས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་ཕྱེད་རོ་སྨད་བཅད་མ་ཐག་ཏུ་སའི་སྟེང་དུ་བཞག་པ་དང་འགུལ་བར་གྱུར་ཏོ།
en: “In the meantime, the two carpenters whom Śakra had enchanted finished cutting the bodhisattva’s body in half. They placed the lower half of his body on the ground and it began to twitch.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རང་གི་ལུས་བཅད་པའི་སྡུག་བསྔལ་མི་སེམས་པར་རིངས་བག་ཉིད་དུ་སྐྱེས་བུ་དེ་གཉིས་ལ་འདི་སྐད་སྨྲས་སོ།
en: Without thinking of his own suffering—the suffering of having his body cut in half—the bodhisattva addressed the two men:

source: །བཞིན་བཟངས་དག་ཁྱོད་ཅག་གཉིས་ཀྱིས་མྱུར་དུ་ངའི་ལུས་འདི་རིངས་པ་རིངས་པར་བྲམ་ཟེའི་ལུས་ལ་སྦྱོར་ཅིག །དེ་གཉིས་ཀྱིས་ཀྱང་དེ་བཞིན་དུ་བྱས་སོ།
en: ‘Good people, join my lower half to the brahmin’s body without delay.’ They did as he instructed.

source: །སྦྱར་བ་ཙམ་གྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཇི་ལྟར་སྐད་ཅིག་མ་དེ་ཉིད་ལ་རྨ་ཀུན་དུ་འབྱོར་ཅིང་མཉམ་པར་གནས་པ་དང་། མདོག་འདྲ་བར་སྣང་བ་དེ་ལྟར་བྱིན་གྱིས་བརླབས་ཏེ།
en: At the moment the two body halves were joined, Śakra, lord of the gods, imbued the body with a blessing that made its wounds heal, the joints join together well, and the two bodies’ skin tones match.

source: སྐད་ཅིག་མ་དེ་ལ་སྟོན་ཅིང་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དགའ་བར་བྱ་བའི་ཕྱིར་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཁྲི་ལས་ལངས་ཏེ་འཆག་པ་དང་ལངས་པ་དང་འདུག་པར་གྱུར་ཏོ།
en: He showed everyone the body, and to please the bodhisattva, he, Śakra, lord of the gods, stood up from his stretcher, walked around, stood still, and then sat down.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་སློང་བ་པོའི་ལུས་ཡོངས་སུ་རྫོགས་ཤིང་ཡིད་ལ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་མཐོང་བ་དང་མཆོག་ཏུ་དགའ་བས་ཀུན་དུ་རྒྱས་པའི་ཡིད་ཀྱིས་ངལ་བ་འབྲས་བུ་དང་བཅས་པར་གྱུར་ཅིང་ཡིད་ལ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཏོ་སྙམ་ནས་རབ་ཏུ་དགའ་བའི་ཡིད་ཀྱིས་བསམས་པ།
en: “Seeing that his labors had borne fruit, that the gift seeker had a complete body and his wishes had been fulfilled, the bodhisattva’s mind overflowed with joy.

source: ཇི་ལྟར་ངས་བྲམ་ཟེ་འདི་ལ་རང་གི་ལུས་བྱིན་ཏེ།
en: ‘I have saved this brahmin’s life,’ he thought to himself, ‘and staved off his fear of death by giving him my body.

source: སྡུག་པའི་སྲོག་གིས་བསྐྱབས་ཤིང་འཆི་བའི་འཇིགས་པ་ལས་ཡོངས་སུ་བསྐྱབས་པའི་དགེ་བའི་རྩ་བ་འདིས་འདི་ལྟར་ང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བྲམ་ཟེ་འདི་འཁོར་བའི་སྡུག་བསྔལ་ལས་བསླངས་ཏེ།
en: May the seed of this virtue cause me to attain unsurpassed and perfect awakening. Then may I be able to rescue this brahmin from the suffering of saṃsāra and establish him in nirvāṇa where he will experience the ultimate happiness.’ “As he thought this, the bodhisattva was overwhelmed.

source: ཤིན་ཏུ་མཐར་ཐུག་པའི་བདེ་བ་མྱ་ངན་ལས་འདས་པ་ལ་རབ་ཏུ་འཇོག་པར་གྱུར་ཅིག་ཅེས་སྨྲས་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཚོར་བ་དྲག་པོས་གདུངས་པ་དང་། ཡིད་ཀྱིས་བྱང་ཆུབ་ཏུ་སྨོན་པ་བྱས་ནས་མིག་བཙུམས་ཏེ་བརྒྱལ་བས་གནས་པར་གྱུར་ཏོ།
en: Even as he aspired to awaken, he slipped into unconsciousness, and his eyes began to close.

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དེ་མ་ཐག་ཏུ་རིངས་པ་རིངས་པར་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ལ་འཕྲལ་དུ་སྟོབས་བསྐྱེད་པ་ཡང་འཚོ་བའི་སྨན་གྱིས་ཡང་དག་པར་གསོས་སོ།
en: Śakra, lord of the gods, revived him immediately. He used medicines and care to treat and heal him.

source: །དགེ་སློང་དག་དེ་ནས་རྒྱལ་པོ་དཔལ་གྱི་སྡེའི་ལུས་ཀྱི་ཕྱེད་བཅད་པའི་རྗེས་ཐོགས་ཉིད་ལ་ཡང་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལན་རྣམ་པ་གསུམ་དུ་གཡོས་ཏེ།
en: “Monks, in the instant King Śrīsena’s body was cut in half, the trichiliocosm shook in three different ways:

source: གཡོས་རབ་ཏུ་གཡོས། ཀུན་དུ་རབ་ཏུ་གཡོས། འགུལ་རབ་ཏུ་འགུལ། ཀུན་དུ་རབ་ཏུ་འགུལ་ཏོ།
en: it shook, shook a lot, and shook extremely much.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་ཡོངས་སུ་གཏོང་བ་ཉིད་དང་། རྨད་དུ་བྱུང་བའི་ཡོངས་སུ་གཏོང་བ་ཉིད་ས་ཆེན་པོ་འདིས་མ་ཐེག་པས་སྒྲ་ཤིན་ཏུ་སྒྲོགས་ཏེ།
en: It also rocked, rocked a lot, and rocked extremely much. This great earth was unable to support the bodhisattva’s great act of generosity.

source: འདི་ལྟ་སྟེ་ཁར་བའི་སྣོད་ཆེན་པོ་ཀུན་དུ་བརྡུངས་ནས་སྒྲ་འབྱིན་པ་བཞིན་དུ་དེའི་ཚེ་དེའི་དུས་ན་ས་ཆེན་པོ་འདི་ཉིད་ཤིན་ཏུ་སྒྲ་སྒྲོགས་པར་གྱུར་ཏོ།
en: It was a marvelous gift of everything and thus it resounded—it resounded as if all the world’s cauldrons had been beaten at once.

source: །རི་དང་རི་སུལ་དང་ཆུ་བོ་དང་རྒྱ་མཚོའི་ཚོགས་རྣམས་ལས་ཀྱང་འཇིགས་པའི་སྒྲ་ཆེན་པོ་བྱུང་བར་གྱུར་ཏོ།
en: Mountains, ravines, rivers, and oceans all emitted horrifying noises.

source: །ཕྱོགས་བཞི་ནས་ཀྱང་འཇིགས་སུ་རུང་བའི་དུ་བའི་སྤྲིན་ཆེན་པོ་བྱུང་བར་གྱུར་ཏོ། །ཀུན་ནས་སྐར་མདའ་ལྟུང་བ་དང་། ཕྱོགས་སྲེག་པ་དང་། བར་སྣང་ལ་ཡང་ལྷའི་བུ་རྣམས་རྔ་རྡུང་བར་གྱུར་ཏེ།
en: Terrifying smoke appeared from the four directions. Meteors fell from all sides. Falling stars blazed in every direction. The gods beat drums in the sky.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་མུན་པ་མུན་ནག་ཏུ་གྱུར་ཏོ།
en: “The trichiliocosm first darkened and then turned pitch black.

source: །ནམ་མཁའི་དཀྱིལ་ན་འགྲོ་བའི་ལྷ་རྣམས་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་མྱ་ངན་གྱིས་གདུངས་པས་ཅ་ཅོའི་སྒྲ་བཏོན་ཏོ།
en: Even the gods traversing the center of the sky chattered about a bodhisattva tormented with sorrow.

source: །བར་སྣང་ལས་ཀྱང་ལྷ་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་སྟེང་ནས་ལྷའི་ཨུད་པ་ལ་རྣམས་འཐོར་ཞིང་པད་མ་དང་། པུན་ད་རཱི་ཀ་དང་། ཨ་ཀ་རུའི་ཕྱེ་མ་དང་། ཏ་ག་རུའི་ཕྱེ་མ་དང་། ཏ་མ་ལའི་ལོ་མའི་ཕྱེ་མ་དང་། ཙན་དན་གྱི་ཕྱེ་མ་དང་། ལྷ་རྣམས་ཀྱི་མེ་ཏོག་མན་དཱ་ར་བ་རྣམས་ཀྱང་འཐོར་རོ། །གོས་རྣམས་ཀྱང་འཐོར་བར་བྱེད་དོ། །ལྷའི་རོལ་མོ་ཡང་རབ་ཏུ་རྡུང་ངོ་།
en: They arranged utpala flowers above the bodhisattva and showered him with pink and white lotus flowers. They also sprinkled agaru, tagara, cinnamon-leaf, and sandalwood incense on him, and the flowers of the gods’ tree, the mandārava. They even draped their clothes on him, danced, and played divine music loudly.

source: །འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་དེར་ཡུད་ཙམ་ཞིག་མཆོག་ཏུ་རྨོངས་པར་གྱུར་ཏེ།
en: All of Jambudvīpa’s people were deeply puzzled by these noises.

source: །གྲོང་ཁྱེར་ན་གནས་པའི་སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མ་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་ཕྱེད་བཅད་པ་མཐོང་བ་དང་། སྡུག་བསྔལ་དྲག་པོས་གདུངས་ཏེ།
en: “When the city’s inhabitants, hundreds and thousands of people, saw the bodhisattva’s body cut, they were tormented by intense grief.

source: ཀྱི་ཧུད་ལྷ་བསད་པ་ནི་སྡུག་བསྔལ་ལོ་ཞེས་སྒྲ་གཅིག་ཏུ་བསྒྲགས་སོ།
en: With a single voice they cried out in their grief, ‘Alas, seeing the lord killed is painful!’

source: །དེ་ནས་ལ་ལ་ནི་ས་ལ་འགྲེ་ལྡོག་གོ། །ལ་ལ་ནི་དཔུང་པ་བརྐྱང་ནས་ཆོ་ངེས་འདེབས་སོ།
en: “Some rolled on the ground, others flailed their arms and wailed.

source: །ལ་ལ་ནི་མཆི་མའི་རླབས་ཀྱིས་སྐད་འཛེར་བར་ཚིག་འདོན་མི་ནུས་ཏེ། སྐད་ཆེན་པོ་དང་བྲང་རྡུང་ངོ་།
en: The voices of some became hoarse from passionate sobbing. They were unable to clearly voice their words, yet still they screamed and beat their chests.

source: །ལ་ལ་ནི་མི་རྟག་པ་ཉིད་ཀྱི་སྟོབས་དང་ལྡན་ཞེས་སེམས་སྡུག་བསྔལ་དང་བཅས་ཤིང་ཡིད་མི་བདེ་བ་དང་ལྡན་པས་ཅང་མི་སྨྲ་བར་འདུག་གོ།
en: Others remained silent, their minds mournful and unsettled, thinking, ‘Impermanence is powerful indeed!’

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་རི་རབ་ལྟར་ཤིན་ཏུ་མི་གཡོ་བར་ཤེས་ཤིང་བྱང་ཆུབ་སེམས་དཔའི་རྨད་དུ་བྱུང་བ་ཡོངས་སུ་གཏོང་ལ།
en: “Śakra, lord of the gods, was convinced that the bodhisattva’s resolve to attain unsurpassed and perfect awakening was as immovable as Mount Sumeru. He marveled at how the bodhisattva had given so completely.

source: དེ་ཡང་བ་སྤུ་ལྡང་བ་ནི་ཤིན་ཏུ་དགའ་ཞིང་ཕུལ་དུ་དབྱུང་བ་མཐོང་བ་དང་། ངོ་མཚར་གྱིས་མིག་གདངས་ཏེ་ལྷའི་བུ་དེ་བཞི་དང་ལྷན་ཅིག་ཏུ་བྲམ་ཟེའི་ཆ་བྱད་མི་སྣང་བར་བྱས་ནས་རང་གི་གཟུགས་ཀྱིས་གནས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ།
en: The hairs on his body stood on end. He was filled with joy and witnessed something outstanding. Marveling at this, he opened his eyes, and together with the other four gods, he dissolved his brahmin semblance, and he and the four gods appeared in their own forms. Śakra then spoke to the bodhisattva:

source: རྒྱལ་པོ་ཆེན་པོ་བདག་ནི་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལགས་ཀྱི་བྲམ་ཟེ་མ་ལགས་སོ།
en: ‘Great King! I am no brahmin, I am Śakra, lord of the gods.

source: །རྒྱལ་པོ་ཆེན་པོ་ལེགས་སོ་ལེགས་སོ།
en: Well done, Great King, well done!

source: །ཀྱེ་མའོ་ཁྱོད་ཀྱི་བརྩོན་འགྲུས།
en: How amazing, your diligence!

source: ཀྱེ་མའོ་མ་བཅོས་པར་བརྟན་པ།
en: How amazing, your uncontrived resolve!

source: ཀྱེ་མའོ་རང་གི་ལུས་ལ་མ་ཆགས་པར་ཡོངས་སུ་གཏོང་བ།
en: How amazing that you gave your body so completely, without clinging!

source: ཀྱེ་མའོ་སེམས་ཅན་རྣམས་ལ་སྙིང་བརྩེ་བ།
en: How amazing, your compassion toward sentient beings and love for them!

source: ཀྱེ་མའོ་སྦྱིན་པ་ལ་དགའ་བ་ལེགས་སོ་ལེགས་སོ།
en: Your joy in giving! Well done, well done!

source: །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་གང་དུ་སྡུག་བསྔལ་དྲག་པོས་བཅོམ་ཡང་སྙིང་རྗེས་རང་གི་ལུས་སྦྱིན་པ་ལ་སེམས་མི་ལྡོག་པ་དེ་ནི་ལེགས་སོ།
en: Great King, even though you were overwhelmed by intense suffering, you did not change your mind about giving away your body.

source: །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ལ་དྲི་ཡིས་ཁྱོད་ཤིན་ཏུ་དཀའ་བའི་བརྩོན་པ་འདི་ལྟ་བུས་ཅི་ཞིག་དོན་དུ་གཉེར།
en: Great King, I have a question for you: what was the reason you underwent such hardship and such a prolonged trial?’

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། ཀཽ་ཤི་ཀ་ངའི་ལུས་ཀྱི་སྦྱིན་པ་འདིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: “ ‘Kauśika,’ replied the bodhisattva, ‘by giving away my body, I wish to attain unsurpassed and perfect awakening.

source: སེམས་ཅན་རྣམས་འཁོར་བ་ལས་བསྒྲལ་བར་བྱའོ།
en: I wish to liberate sentient beings from saṃsāra.’

source: །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་རང་གི་ལུས་ཡོངས་སུ་ཟད་པའམ། གཏོང་བའམ། ཡོངས་སུ་བཏང་བས་ཁྱོད་ཀྱི་སེམས་རྣམ་པ་གཞན་དུ་གྱུར་པའམ། འགྱོད་པར་མ་གྱུར་གྲང་།
en: “Śakra then asked, ‘Great King, as your body was deteriorating, as you offered your body, as you gave it away completely, did you have any regrets? Did your mental state change at all?’

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། ཀཽ་ཤི་ཀ་ང་ལ་ནི་འགྱོད་པ་མེད་དོ།
en: “ ‘Kauśika, I had no regrets,’ replied the bodhisattva.

source: །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། ཇི་ལྟར་ཤེས་པར་བྱ། བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ།
en: “ ‘How can we know this?’ Śakra asked. “ ‘Kauśika,’ said the bodhisattva, ‘to prove it, I will allow you to place the lower half of my body wherever you like.’

source: ཀཽ་ཤི་ཀ་དེའི་ཕྱིར་ངའི་ལུས་ཀྱི་ཕྱེད་བཅད་པ་འདི་གནས་ཇི་ལྟ་བ་བཞིན་དུ་ཞོག་ཤིག །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་ཕྱེད་བཅད་པ་དེ་གནས་ཇི་ལྟ་བ་བཞིན་དུ་བཞག་གོ།
en: “Śakra, lord of the gods, then put the lower half of the bodhisattva’s body in a place of his liking.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཅན་ཐམས་ཅད་ལ་རྗེས་སུ་འགྲོ་བའི་བྱམས་པའི་སེམས་ཉེ་བར་བཞག་ནས་བདེན་པ་གསོལ་བར་བྱེད་ཅིང་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The bodhisattva established a loving attitude toward all sentient beings, and invoking truth at that time, he spoke the following verses:

source: ཇི་ལྟར་བྱང་ཆུབ་འདོད་གྱུར་ནས། །སྙིང་རྗེས་ལུས་ནི་བཏང་བས་ན། །སེར་སྣ་མེད་ཅིང་ཞུམ་མེད་དེ།
en: “ ‘As I wish for awakening, I did not experience miserliness or sadness When I let go of my body compassionately.

source: །དེང་ནི་འགྱོད་པར་གྱུར་པ་མེད།
en: Now, I have no regrets.

source: །འགྱོད་པའི་སེམས་ཀྱང་མེད་གྱུར་ན།
en: “ ‘And as I have no regrets, Śakra,

source: །བདེན་ཚིག་འདི་དང་ལེགས་བྱས་པས།
en: May the truth of my words and goodness of my actions

source: །བརྒྱ་བྱིན་དེང་ནི་ང་ཡི་ལུས།
en: Now restore my body,

source: །འདི་ནི་སྔོན་གྱི་ཇི་བཞིན་དུ།
en: Exactly as it was before.

source: །དབང་པོ་མ་ལུས་རྫོགས་གྱུར་ཅིག །དགེ་སློང་དག་ཚིགས་སུ་བཅད་པ་དེ་སྨྲས་པའི་རྗེས་ཐོགས་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་འཕྲལ་དུ་སྔོན་གྱི་ཇི་ལྟ་བ་བཞིན་དུ་གྱུར་ཏོ།
en: May all my senses be complete!’ “Monks, as soon as he spoke these verses, the bodhisattva’s body was restored.

source: །ནམ་མཁའི་དཀྱིལ་ན་གནས་པའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱིས་ངོ་མཚར་དེ་མཐོང་བ་དང་། ངོ་མཚར་ཀྱིས་མིག་གདངས་ཏེ། ཅ་ཅོ་དང་ག་ཞའི་སྒྲ་སྒྲོགས་སོ།
en: The sky-dwelling gods, nāgas, yakṣas, garuḍas, kinnaras, and mahoragas who witnessed this were wide-eyed in amazement and started babbling and laughing.

source: །སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་འདི་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་ངོ་མཚར་དང་རྨད་དུ་བྱུང་བ་དང་། ལྷ་དང་མི་རྣམས་ཡིད་སྡུག་པར་བྱེད་པའི་ཆོ་འཕྲུལ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཡོངས་སུ་རྫོགས་པ་མཐོང་བ་དང་སྲོག་སྟོར་བ་ལས་སླར་རྙེད་པ་བཞིན་དུ་མཆོག་ཏུ་ངོ་མཚར་སྐྱེས་སོ།
en: The crowds of people gathered there were also awed and amazed. Both gods and humans were overjoyed at this magical display. When they saw that the bodhisattva’s body was completely restored, they developed wonder as if they had found their own lives after having lost them.

source: །འདི་སྐད་ཅེས་ཀྱང་སྨྲས་ཏེ། ཀྱེ་མ་ཁྱེད་ནི་སླར་འཚོ་བའི། །ངོ་མཚར་དག་ནི་བལྟ་བར་གྱིས།
en: They said, ‘How amazing! Let us gaze upon this marvel of your resurrection!

source: །ས་དང་ནགས་སུ་བཅས་པ་ཡི། །འཇིག་རྟེན་འདི་ནི་སྐལ་བར་ལྡན།
en: The beings of this world, those on the land and in the forest, are fortunate indeed!’

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སྔོན་གྱི་ཇི་ལྟ་བ་བཞིན་དུ་གྱུར་པར་མཐོང་བ་དང་ངོ་མཚར་གྱིས་གདུངས་པའི་མིག་དང་། སྤྲོ་བ་བསྐྱེད་པའི་ཕྱིར་སྨྲས་པ།
en: “When Śakra, lord of the gods, saw that the bodhisattva’s body had been restored to its original state, he was overwhelmed. To please the bodhisattva, he said, ‘Great King, your mind is heroic.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱི་བླ་ཤིན་ཏུ་དེས་པ་དང་། ཁྱོད་ཀྱི་སྨོན་ལམ་མི་འགྱུར་བ་དང་། ཁྱོད་ཀྱི་སེམས་ཅན་ལ་སྙིང་རྗེ་ཆེན་པོས་རྗེས་སུ་ཞུགས་པ་ནི་ལེགས་སོ་ལེགས་སོ།
en: Your aspiration is steadfast, and you engage with sentient beings out of great compassion. Well done, well done!
